
/** @file
  * EpsDiskId/diskid32.cpp
  *
  * @author 
  * Lynn McGuire
  *
  * @modified by 
  * Konstantin Tchoumak 
  *
  * Freeware code
  * for reading the manufacturor's information from your hard drives
  *
  * 06/11/00  Lynn McGuire  written with many contributions from others,
  *                           IDE drives only under Windows NT/2K and 9X,
  *                           maybe SCSI drives later
  * 11/20/03  Lynn McGuire  added ReadPhysicalDriveInNTWithZeroRights
  * 10/26/05  Lynn McGuire  fix the flipAndCodeBytes function
  * 01/22/08  Lynn McGuire  incorporate changes from Gonzalo Diethelm,
  *                            remove media serial number code since does 
  *                            not work on USB hard drives or thumb drives
  * 01/29/08  Lynn McGuire  add ReadPhysicalDriveInNTUsingSmart
  * http://www.winsim.com/diskid32/diskid32.html
  * 01/29/10  Konstantin Tchoumak  adopted for VS2010  x86/x64
  * 10/10/13  Konstantin Tchoumak  adopted for VS2010  C++/CLI. Removed Win95 platform
  */


#include <stdlib.h>
#include <stdio.h>
#include <stddef.h>
#include <string.h>

#include <Winsock2.h>

#include <windows.h>
#include <winioctl.h>


#include "diskid.h"

#define  TITLE   "DiskId32"

using namespace std;

#pragma warning (disable : 4996)

   //  IOCTL commands
#define  DFP_GET_VERSION          0x00074080
#define  DFP_SEND_DRIVE_COMMAND   0x0007c084
#define  DFP_RECEIVE_DRIVE_DATA   0x0007c088

#define  FILE_DEVICE_SCSI              0x0000001b
#define  IOCTL_SCSI_MINIPORT_IDENTIFY  ((FILE_DEVICE_SCSI << 16) + 0x0501)
#define  IOCTL_SCSI_MINIPORT 0x0004D008  //  see NTDDSCSI.H for definition

#define SMART_GET_VERSION               CTL_CODE(IOCTL_DISK_BASE, 0x0020, METHOD_BUFFERED, FILE_READ_ACCESS)
#define SMART_SEND_DRIVE_COMMAND        CTL_CODE(IOCTL_DISK_BASE, 0x0021, METHOD_BUFFERED, FILE_READ_ACCESS | FILE_WRITE_ACCESS)
#define SMART_RCV_DRIVE_DATA            CTL_CODE(IOCTL_DISK_BASE, 0x0022, METHOD_BUFFERED, FILE_READ_ACCESS | FILE_WRITE_ACCESS)


   //  Bits returned in the fCapabilities member of GETVERSIONOUTPARAMS 
#define  CAP_IDE_ID_FUNCTION             1  // ATA ID command supported
#define  CAP_IDE_ATAPI_ID                2  // ATAPI ID command supported
#define  CAP_IDE_EXECUTE_SMART_FUNCTION  4  // SMART commannds supported

   //  Valid values for the bCommandReg member of IDEREGS.
#define  IDE_ATAPI_IDENTIFY  0xA1  //  Returns ID sector for ATAPI.
#define  IDE_ATA_IDENTIFY    0xEC  //  Returns ID sector for ATA.

   // The following struct defines the interesting part of the IDENTIFY
   // buffer:
typedef struct _IDSECTOR
{
   USHORT  wGenConfig;
   USHORT  wNumCyls;
   USHORT  wReserved;
   USHORT  wNumHeads;
   USHORT  wBytesPerTrack;
   USHORT  wBytesPerSector;
   USHORT  wSectorsPerTrack;
   USHORT  wVendorUnique[3];
   CHAR    sSerialNumber[20];
   USHORT  wBufferType;
   USHORT  wBufferSize;
   USHORT  wECCSize;
   CHAR    sFirmwareRev[8];
   CHAR    sModelNumber[40];
   USHORT  wMoreVendorUnique;
   USHORT  wDoubleWordIO;
   USHORT  wCapabilities;
   USHORT  wReserved1;
   USHORT  wPIOTiming;
   USHORT  wDMATiming;
   USHORT  wBS;
   USHORT  wNumCurrentCyls;
   USHORT  wNumCurrentHeads;
   USHORT  wNumCurrentSectorsPerTrack;
   ULONG   ulCurrentSectorCapacity;
   USHORT  wMultSectorStuff;
   ULONG   ulTotalAddressableSectors;
   USHORT  wSingleWordDMA;
   USHORT  wMultiWordDMA;
   BYTE    bReserved[128];
} IDSECTOR, *PIDSECTOR;


typedef struct _SRB_IO_CONTROL
{
   ULONG HeaderLength;
   UCHAR Signature[8];
   ULONG Timeout;
   ULONG ControlCode;
   ULONG ReturnCode;
   ULONG Length;
} SRB_IO_CONTROL, *PSRB_IO_CONTROL;


   // Define global buffers.
BYTE IdOutCmd [sizeof (SENDCMDOUTPARAMS) + IDENTIFY_BUFFER_SIZE - 1];

   //  Max number of drives assuming primary/secondary, master/slave topology
#define  MAX_IDE_DRIVES  16

namespace Utils
{
    bool DiskInfo::DoIdentify ( void * hPhysicalDriveIOCTL, PSENDCMDINPARAMS pSCIP,
                        PSENDCMDOUTPARAMS pSCOP, unsigned __int8 nIDCmd, unsigned __int8 nDriveNum,
                        unsigned __int32 * lpcbBytesReturned )
    {
        if( nullptr == pSCIP )
        {
            return false;
        }
            // Set up data structures for IDENTIFY command.
        pSCIP->cBufferSize                 = IDENTIFY_BUFFER_SIZE;
        pSCIP->irDriveRegs.bFeaturesReg    = 0;
        pSCIP->irDriveRegs.bSectorCountReg = 1;
        pSCIP->irDriveRegs.bCylLowReg      = 0;
        pSCIP->irDriveRegs.bCylHighReg     = 0;

            // Compute the drive number.
        pSCIP->irDriveRegs.bDriveHeadReg = 0xA0 | ((nDriveNum & 1) << 4);

            // The command can either be IDE identify or ATAPI identify.
        pSCIP->irDriveRegs.bCommandReg = nIDCmd;
        pSCIP->bDriveNumber            = nDriveNum;
        pSCIP->cBufferSize             = IDENTIFY_BUFFER_SIZE;

        return IsDeviceIoControl( hPhysicalDriveIOCTL, DFP_RECEIVE_DRIVE_DATA,
                                  (LPVOID) pSCIP,
                                  sizeof(SENDCMDINPARAMS) - 1,
                                  (LPVOID) pSCOP,
                                  sizeof(SENDCMDOUTPARAMS) + IDENTIFY_BUFFER_SIZE - 1,
                                  (LPDWORD)lpcbBytesReturned );
    }
    //----------------------------------------------------------------------------------------------------------------------
    char *DiskInfo::ConvertToString( unsigned __int32 diskData[256], const size_t firstIndex, const size_t lastIndex )
    {
        if( nullptr == diskData || lastIndex < firstIndex )
        {
            return nullptr;
        }
        ::memset( m_cv, 0, sizeof(m_cv) );
        size_t position = 0;

            //  each integer has two characters stored in it backwards
        for(size_t index = firstIndex; index <= lastIndex; index++)
        {
                //  get high byte for 1st character
            m_cv[position] = static_cast<char>( diskData [index] / 256 );
            position++;

                //  get low byte for 2nd character
            m_cv[position] = static_cast<char>( diskData [index] % 256 );
            position++;
        }
            //  end the string 
        m_cv[position] = '\0';

            //  cut off the trailing blanks
        if( 0 < position )
        {
            for( size_t index = position - 1; index > 0 && ' ' == m_cv[index]; index-- )
            {
                m_cv [index] = '\0';
            }
        }
        return m_cv;
    }
    //----------------------------------------------------------------------------------------------------------------------
    bool DiskInfo::ReadPhysicalDriveInNTWithAdminRights( std::vector<disk_t> &disks )
    {
        bool done = false;
        disks.clear();

        for( size_t drive = 0; drive < MAX_IDE_DRIVES; drive++)
        {
            wchar_t wzMsg[255] = {0};

                //  Try to get a handle to PhysicalDrive IOCTL, report failure
                //  and exit if can't.
            wchar_t wzDriveName[256] = {0};

            ::_snwprintf( wzDriveName, _countof(wzDriveName)-1, L"\\\\.\\PhysicalDrive%d", (int)drive );

            HANDLE hPhysicalDriveIOCTL = OpenDevice( wzDriveName, GENERIC_READ | GENERIC_WRITE );  //  Windows NT, Windows 2000, must have admin rights

            if( INVALID_HANDLE_VALUE == hPhysicalDriveIOCTL )
            {
                ::_snwprintf( wzMsg, _countof(wzMsg)-1,
                            L"Unable to open physical drive %d, error code: 0x%lX\n",
                            (int)drive, GetLastError () );
                LogMessage( DID_INVALID_HANDLE_VALUE_e, wzMsg, __LINE__, __FUNCTION__ );

                return false;
            }
            if( INVALID_HANDLE_VALUE != hPhysicalDriveIOCTL )
            {
                GETVERSIONOUTPARAMS VersionParams;
                unsigned __int32    cbBytesReturned = 0x00;

                // Get the version, etc of PhysicalDrive IOCTL
                ::memset( (void*) &VersionParams, 0x00, sizeof(VersionParams) );

                if ( !IsDeviceIoControl( hPhysicalDriveIOCTL, DFP_GET_VERSION, NULL, 0
                                       , &VersionParams, sizeof(VersionParams), (LPDWORD)&cbBytesReturned ) )
                {         
                    ::_snwprintf( wzMsg, _countof(wzMsg)-1, L"DFP_GET_VERSION failed for drive %d\n", (int)drive );
                    LogMessage( DID_FAILED_DFP_GET_VERSION_e, wzMsg, __LINE__, __FUNCTION__ );

                    continue;
                }
                // If there is a IDE device at number "drive" issue commands
                // to the device
                if( 0 < VersionParams.bIDEDeviceMap )
                {
                    SENDCMDINPARAMS  scip;

                    // Now, get the ID sector for all IDE devices in the system.
                        // If the device is ATAPI use the IDE_ATAPI_IDENTIFY command,
                        // otherwise use the IDE_ATA_IDENTIFY command
                    BYTE bIDCmd = ( VersionParams.bIDEDeviceMap >> drive & 0x10 ) ? IDE_ATAPI_IDENTIFY : IDE_ATA_IDENTIFY;  

                    ::memset( &scip,        0x00, sizeof(scip) );
                    ::memset( m_szIdOutCmd, 0x00, sizeof(m_szIdOutCmd) );

                    if( DoIdentify( hPhysicalDriveIOCTL, 
                                &scip, 
                                (PSENDCMDOUTPARAMS)&m_szIdOutCmd, 
                                (BYTE) bIDCmd,
                                (BYTE) drive,
                                &cbBytesReturned) )
                    {
                        unsigned __int32 diskdata [256] = {0};
                        unsigned short *pIdSector = (unsigned short *)( (PSENDCMDOUTPARAMS)m_szIdOutCmd )->bBuffer;

                        for( int ijk = 0; ijk < 256; ijk++ )
                        {
                            diskdata [ijk] = pIdSector [ijk];
                        }
                        disk_t _disk;
                        done = GetIdeInfo( drive, diskdata, _disk );

                        if( done )
                        {
                            disks.push_back( _disk );
                        }
                    }
                }
                CloseDevice( hPhysicalDriveIOCTL );
            }
        }
        return done;
    }

// IDENTIFY data (from ATAPI driver source)
//

#pragma pack(1)

typedef struct _IDENTIFY_DATA {
    USHORT GeneralConfiguration;            // 00 00
    USHORT NumberOfCylinders;               // 02  1
    USHORT Reserved1;                       // 04  2
    USHORT NumberOfHeads;                   // 06  3
    USHORT UnformattedBytesPerTrack;        // 08  4
    USHORT UnformattedBytesPerSector;       // 0A  5
    USHORT SectorsPerTrack;                 // 0C  6
    USHORT VendorUnique1[3];                // 0E  7-9
    USHORT SerialNumber[10];                // 14  10-19
    USHORT BufferType;                      // 28  20
    USHORT BufferSectorSize;                // 2A  21
    USHORT NumberOfEccBytes;                // 2C  22
    USHORT FirmwareRevision[4];             // 2E  23-26
    USHORT ModelNumber[20];                 // 36  27-46
    UCHAR  MaximumBlockTransfer;            // 5E  47
    UCHAR  VendorUnique2;                   // 5F
    USHORT DoubleWordIo;                    // 60  48
    USHORT Capabilities;                    // 62  49
    USHORT Reserved2;                       // 64  50
    UCHAR  VendorUnique3;                   // 66  51
    UCHAR  PioCycleTimingMode;              // 67
    UCHAR  VendorUnique4;                   // 68  52
    UCHAR  DmaCycleTimingMode;              // 69
    USHORT TranslationFieldsValid:1;        // 6A  53
    USHORT Reserved3:15;
    USHORT NumberOfCurrentCylinders;        // 6C  54
    USHORT NumberOfCurrentHeads;            // 6E  55
    USHORT CurrentSectorsPerTrack;          // 70  56
    ULONG  CurrentSectorCapacity;           // 72  57-58
    USHORT CurrentMultiSectorSetting;       //     59
    ULONG  UserAddressableSectors;          //     60-61
    USHORT SingleWordDMASupport : 8;        //     62
    USHORT SingleWordDMAActive : 8;
    USHORT MultiWordDMASupport : 8;         //     63
    USHORT MultiWordDMAActive : 8;
    USHORT AdvancedPIOModes : 8;            //     64
    USHORT Reserved4 : 8;
    USHORT MinimumMWXferCycleTime;          //     65
    USHORT RecommendedMWXferCycleTime;      //     66
    USHORT MinimumPIOCycleTime;             //     67
    USHORT MinimumPIOCycleTimeIORDY;        //     68
    USHORT Reserved5[2];                    //     69-70
    USHORT ReleaseTimeOverlapped;           //     71
    USHORT ReleaseTimeServiceCommand;       //     72
    USHORT MajorRevision;                   //     73
    USHORT MinorRevision;                   //     74
    USHORT Reserved6[50];                   //     75-126
    USHORT SpecialFunctionsEnabled;         //     127
    USHORT Reserved7[128];                  //     128-255
} IDENTIFY_DATA, *PIDENTIFY_DATA;

#pragma pack()

    #define ID_CMD          0xEC            // Returns ID sector for ATA

    bool DiskInfo::ReadPhysicalDriveInNTUsingSmart(  std::vector<disk_t> &disks )
    {
       disks.clear();
       bool done = false;

       for( size_t drive = 0; drive < MAX_IDE_DRIVES; drive++ )
       {
          HANDLE hPhysicalDriveIOCTL = 0;

             //  Try to get a handle to PhysicalDrive IOCTL, report failure
             //  and exit if can't.
          wchar_t wzDriveName[256] = {L'\0'};

          ::_snwprintf( wzDriveName, _countof(wzDriveName)-1, L"\\\\.\\PhysicalDrive%d", (int)drive );

             //  Windows NT, Windows 2000, Windows Server 2003, Vista
          hPhysicalDriveIOCTL = OpenDeviceSmart( wzDriveName );

          if( hPhysicalDriveIOCTL == INVALID_HANDLE_VALUE )
          {
